tutorials/staircaseStudy/staircaseGrid1000/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

touch foam.foam

cp -r 0.orig 0/

runApplication blockMesh

runApplication decomposePar

runApplication mpirun -np 16 simpleFoam -parallel

runApplication reconstructPar -latestTime

#postProcess -func CVforces -latestTime
